#include"Common.h"
#include<stdio.h>

void gotoxy(int x, int y)
{
	COORD pos = { x,y };
	SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE), pos);
}
void setcolor(int color, int bgcolor)

{

	color &= 0xf;

	bgcolor &= 0xf;

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), (bgcolor << 4) | color);

}
const char *num[9][5][4] =
{
	{
		{"  ","  ","  ","бс"},
		{"  ","  ","  ","бс"},
		{"  ","  ","  ","бс"},
		{"  ","  ","  ","бс"},
		{"  ","  ","  ","бс"},
	},
		{
		{"бс","бс","бс","бс"},
		{"  ","  ","  ","бс"},
		{"бс","бс","бс","бс"},
		{"бс","  ","  ","  "},
		{"бс","бс","бс","бс"},
	},
	{
		{"бс","бс","бс","бс"},
		{"  ","  ","  ","бс"},
		{"бс","бс","бс","бс"},
		{"  ","  ","  ","бс"},
		{"бс","бс","бс","бс"},
	},
	{
		{"бс","  ","  ","бс"},
		{"бс","  ","  ","бс"},
		{"бс","бс","бс","бс"},
		{"  ","  ","  ","бс"},
		{"  ","  ","  ","бс"},
	},
	{
		{"бс","бс","бс","бс"},
		{"бс","  ","  ","  "},
		{"бс","бс","бс","бс"},
		{"  ","  ","  ","бс"},
		{"бс","бс","бс","бс"},
	},
	{
		{"бс","  ","  ","  "},
		{"бс","  ","  ","  "},
		{"бс","бс","бс","бс"},
		{"бс","  ","  ","бс"},
		{"бс","бс","бс","бс"},
	},
	{
		{"бс","бс","бс","бс"},
		{"бс","  ","  ","бс"},
		{"  ","  ","  ","бс"},
		{"  ","  ","  ","бс"},
		{"  ","  ","  ","бс"},
	},
	{
		{"бс","бс","бс","бс"},
		{"бс","  ","  ","бс"},
		{"бс","бс","бс","бс"},
		{"бс","  ","  ","бс"},
		{"бс","бс","бс","бс"},
	},
	{
		{"бс","бс","бс","бс"},
		{"бс","  ","  ","бс"},
		{"бс","бс","бс","бс"},
		{"  ","  ","  ","бс"},
		{"  ","  ","  ","бс"},
	}
};
